## 01- How to find version of pandas

In [2]:
import pandas as pd
pd.__version__

'2.1.1'

In [3]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit              : e86ed377639948c64c429059127bcf5b359ab6be
python              : 3.10.12.final.0
python-bits         : 64
OS                  : Linux
OS-release          : 6.2.0-34-generic
Version             : #34~22.04.1-Ubuntu SMP PREEMPT_DYNAMIC Thu Sep  7 13:12:03 UTC 2
machine             : x86_64
processor           : x86_64
byteorder           : little
LC_ALL              : None
LANG                : en_US.UTF-8
LOCALE              : en_US.UTF-8

pandas              : 2.1.1
numpy               : 1.26.1
pytz                : 2022.1
dateutil            : 2.8.2
setuptools          : 59.6.0
pip                 : 22.0.2
Cython              : None
pytest              : None
hypothesis          : None
sphinx              : None
blosc               : None
feather             : None
xlsxwriter          : None
lxml.etree          : None
html5lib            : None
pymysql             : None
psycopg2            : None
jinja2              : None
IPython             : 8.16.1
pandas_datareader   : None
bs4                 : None
bottleneck          : None
dataframe-api-compat: None
fastparquet         : None
fsspec              : None
gcsfs               : None
matplotlib          : 3.8.0
numba               : None
numexpr             : None
odfpy               : None
openpyxl            : 3.1.2
pandas_gbq          : None
pyarrow             : None
pyreadstat          : None
pyxlsb              : None
s3fs                : None
scipy               : None
sqlalchemy          : None
tables              : None
tabulate            : None
xarray              : None
xlrd                : None
zstandard           : None
tzdata              : 2023.3
qtpy                : None
pyqt5               : None

## 02 - Making DataFrame

In [4]:
df = pd.DataFrame({'A Col': [1, 2, 3, 11, 19, 21],
                   'B Col': [4, 5, 6, 27, 40, 41]})
df

   A Col  B Col
0      1      4
1      2      5
2      3      6
3     11     27
4     19     40
5     21     41

In [5]:
# using numpy
import numpy as np

In [6]:
arr =np.array([
  [1, 2, 11],
  [3,4, 21],
  [7,8, 19]
])
arr

array([[ 1,  2, 11],
       [ 3,  4, 21],
       [ 7,  8, 19]])

In [7]:
pd.DataFrame(arr)

   0  1   2
0  1  2  11
1  3  4  21
2  7  8  19

In [8]:
pd.DataFrame(np.random.randn(4,8))

,0,1,2,3,4,5,6,7
0,-0.362536,1.944047,0.801664,1.062738,-0.541280,-0.255051,-2.176928,-0.002539
1,-0.487989,-1.070270,0.727670,2.005839,-0.772506,1.210172,0.045394,0.208977
2,0.039165,-1.700824,0.288269,-0.281597,2.620262,-0.445800,-2.891461,1.432405
3,-1.602174,2.990278,-0.385091,-0.099004,1.509620,0.169219,0.128174,-0.668220

In [9]:
pd.DataFrame(np.random.randn(4,8), columns=list('ABCDEFGH'))

,A,B,C,D,E,F,G,H
0,1.659462,0.321637,0.560587,1.316123,0.049167,-1.158569,-0.312702,1.960511
1,0.623029,-1.306724,1.150642,1.557113,-0.219307,-0.672844,0.604581,-0.797690
2,-1.082154,0.289724,-0.335104,-0.643276,-1.313053,0.274682,1.071959,-1.082027
3,1.416514,1.861065,0.350797,0.370715,1.163712,-1.090923,-0.538942,-0.195506

## 3- How to rename columns

In [10]:
df = pd.DataFrame({'A Col': [1, 2, 3, 11, 19, 21],
                   'B Col': [4, 5, 6, 27, 40, 41]})
df

   A Col  B Col
0      1      4
1      2      5
2      3      6
3     11     27
4     19     40
5     21     41

In [12]:
df.rename(columns={'A Col':'col_a', 'B Col':'col_b'}, inplace=True)
df

   col_a  col_b
0      1      4
1      2      5
2      3      6
3     11     27
4     19     40
5     21     41

In [13]:
# rename another way
df.columns=['col_aa', 'col_bb']
df

   col_aa  col_bb
0       1       4
1       2       5
2       3       6
3      11      27
4      19      40
5      21      41

In [14]:
# To replace any character in string
df.columns = df.columns.str.replace('_', ' ')
df

   col aa  col bb
0       1       4
1       2       5
2       3       6
3      11      27
4      19      40
5      21      41

In [15]:
df.columns = df.columns.str.replace(' ', '_')
df

   col_aa  col_bb
0       1       4
1       2       5
2       3       6
3      11      27
4      19      40
5      21      41

In [16]:
# Add prefix to columns
df = df.add_prefix('baba')
df

   babacol_aa  babacol_bb
0           1           4
1           2           5
2           3           6
3          11          27
4          19          40
5          21          41

In [17]:
# Add suffix to columns
df = df.add_suffix('_baba')
df

   babacol_aa_baba  babacol_bb_baba
0                1                4
1                2                5
2                3                6
3               11               27
4               19               40
5               21               41

In [18]:
df.columns = ['col_a', 'col_b']
df

   col_a  col_b
0      1      4
1      2      5
2      3      6
3     11     27
4     19     40
5     21     41